Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/LowPower/Source/MKW36Z/PWRLib.c
/*! *********************************************************************************
* Copyright (c) 2015, Freescale Semiconductor, Inc.
* Copyright 2016-2017, 2022 NXP
* All rights reserved.
*
* \file
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

/*****************************************************************************
 *                               INCLUDED HEADERS                            *
 *---------------------------------------------------------------------------*
 * Add to this section all the headers that this module needs to include.    *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
#include "EmbeddedTypes.h"
#include "fsl_device_registers.h"
#include "board.h"
#include "PWRLib.h"
#include "PWR_Configuration.h"
#include "TimersManager.h"
#include "fsl_os_abstraction.h"
#include "Keyboard.h"   
#include "GPIO_Adapter.h"
#include "gpio_pins.h"
#include "clock_config.h"
#include "setjmp.h"
#include "TMR_Adapter.h"
#include "DCDC.h"
/*****************************************************************************
 *                             PRIVATE MACROS                                *
 *---------------------------------------------------------------------------*
 * Add to this section all the access macros, registers mappings, bit access *
 * macros, masks, flags etc ...                                              *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
#define mLptmrTimoutMaxMs_c         (65535000U)
#define mLptmrTimoutMaxFreqTicks_c  (2147450880U)
#define mLptmrMaxFreq_c             (32768U)
    
/* computes two 32KHz clock duration to be measured using mDelayFct( its loop takes exactly 5 MCU ticks)   the LPTMR needs two clocks to modify its value after enable 
2/BOARD_XTAL32K_CLK_HZ = 5 * counts /BOARD_BOOTCLOCKRUN_CORE_CLOCK
counts =  (BOARD_BOOTCLOCKRUN_CORE_CLOCK * 2)/(BOARD_XTAL32K_CLK_HZ * 5)  then counts is adjusted with 11/10 to overcome eventual RC based MCU clock deviation */
#define mTwo32KTicksDuration_c                            (((BOARD_BOOTCLOCKRUN_CORE_CLOCK/(BOARD_XTAL32K_CLK_HZ * 5U))* 11U)/5U)
#define mPWR_32kTickInLoopTicks_c                         (BOARD_BOOTCLOCKRUN_CORE_CLOCK/(BOARD_XTAL32K_CLK_HZ * 5U))     
#define mPWR_RFOscRecoveryWaitSwitchOffInLoopCounts_c     ((BOARD_BOOTCLOCKRUN_CORE_CLOCK * cPWR_RFOscRecoveryWaitSwitchOffInUs)/(1000000U* 5U)) 

#if (cPWR_BLE_LL_Enable)   
/* LLS3 + BLE DSM wakeup on the first next instant by BLE timer */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_1  (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* LLS3 + BLE DSM wakeup on deepSleepTimeInMs by BLE timer*/
#define BLE_LL_CLOCK_CONFIG_LP_MOD_2  (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_DSM_INT_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* LLS3 + BLE idle wakeup on deepSleepTimeInMs by LPTMR */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_3  (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_DSM_INT_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* VLLS0 + BLE idle wakeup by keyboard */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_4  (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_DSM_INT_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* VLLS2 + BLE idle wakeup by keyboard */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_5  (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_DSM_INT_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* STOP wakeup on deepSleepTimeInMs by LPTMR */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_6  (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

#define BLE_LL_CLOCK_CONFIG_LP_MOD_8  (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)
#endif /* (cPWR_BLE_LL_Enable) */

/* Define KW35/KW36 LPUART IRQ number */
#if FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1
#define mUartIrq_d (LPUART0_LPUART1_IRQn)
#else
#define mUartIrq_d (LPUART0_IRQn)
#endif

#if(cPWR_WaitFor32kOscStart && (cPWR_EnableDeepSleepMode_1 || cPWR_EnableDeepSleepMode_8) && cPWR_BLE_LL_Enable)
#define mPWR_WaitFor32kOscStart_c (1)
#else
#define mPWR_WaitFor32kOscStart_c (0)
#endif
/*****************************************************************************
 *                        PRIVATE TYPE DEFINITIONS                            *
 *---------------------------------------------------------------------------*
 * Add to this section all the data types definitions: stuctures, unions,    *
 * enumerations, typedefs ...                                                *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
typedef void(*pfDelay_t)(uint32_t);
typedef union delayFctCall_tag
{
    uint32_t funcAddress;
    pfDelay_t functionCall;
}delayFctCall_t;

/*****************************************************************************
 *                               PRIVATE VARIABLES                           *
 *---------------------------------------------------------------------------*
 * Add to this section all the variables and constants that have local       *
 * (file) scope.                                                             *
 * Each of this declarations shall be preceded by the 'static' keyword.      *
 * These variables / constants cannot be accessed outside this module.       *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
#if cPWR_EnableDeepSleepMode_8 || cPWR_EnableDeepSleepMode_5
jmp_buf                   pwr_CPUContext;
#endif
#if (cPWR_BLE_LL_Enable)
const uint16_t maBLE_LL_CLOCK_CONFIG_LP[] = {BLE_LL_CLOCK_CONFIG_LP_MOD_1,
                                             BLE_LL_CLOCK_CONFIG_LP_MOD_2,
                                             BLE_LL_CLOCK_CONFIG_LP_MOD_3,
                                             BLE_LL_CLOCK_CONFIG_LP_MOD_4,
                                             BLE_LL_CLOCK_CONFIG_LP_MOD_5,
                                             BLE_LL_CLOCK_CONFIG_LP_MOD_6,
                                             BLE_LL_CLOCK_CONFIG_LP_MOD_6,
                                             BLE_LL_CLOCK_CONFIG_LP_MOD_8};
#endif /* (cPWR_BLE_LL_Enable) */

#if (cPWR_UsePowerDownMode == 1)
static uint8_t mPWRLib_DeepSleepMode = cPWR_DeepSleepMode;
/* LPTMR variables */
static uint32_t mPWRLib_RTIElapsedTicks;
#if PWR_EnableRtosSysticks
const uint8_t maLPModeUseLPTMR[] = {0, 1, 1, 1, 0, 1, 1, 1, 1};
#else
const uint8_t maLPModeUseLPTMR[] = {0, 1, 1, 1, 0, 0, 1, 1, 1};
#endif /* PWR_EnableRtosSysticks */
static pfPWRCallBack_t gpfPWR_VLLS_EnterCb;
static pfPWRCallBack_t gpfPWR_WarmbootCb;
/*
The array bellow implements this function 
void delay(uint32_t count)
{
    while(count)
    {
        count--;
    }
}
the loop takes 5 exactly MCU clocks to execute so knowing MCU clock, a precise delay can be acomplished
*/
const uint16_t mDelayFct[] = {0xb500, 0x2800, 0xd001, 0x1e40, 0xe7fb, 0xbd00};
#endif /* (cPWR_UsePowerDownMode == 1) */

