Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/LowPower/Source/MKW36Z/PWRLib.c
        /* got the exit from timeout, something went wrong on the XTAL32M oscillator , disable it and reset */
        if ( count_down == 0U )
        {
            if(rfOscEn != 0U)
            {
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0U);
            }
#if cPWR_BLE_LL_Enable            
            if(llBle != 0U)
            {
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_EN, 0U);
            }
#endif /* cPWR_BLE_LL_Enable */             
#if cPWR_GENFSK_LL_Enable              
            if(llGfsk != 0U)
            {
                RSIM->DSM_CONTROL &= ~(RSIM_DSM_CONTROL_GEN_SYSCLK_REQUEST_EN_MASK | RSIM_DSM_CONTROL_GEN_SYSCLK_REQ_INT_MASK);
            }
#endif /* cPWR_GENFSK_LL_Enable */             
            /* wait some time for Oscillator to switch off */
            PWRLib_DelayLoop(mPWR_RFOscRecoveryWaitSwitchOffInLoopCounts_c);
            
            /* turn back the oscillator ON, it should recover now */
            if(rfOscEn != 0U)
            {
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);
            }
#if cPWR_BLE_LL_Enable             
            if(llBle != 0U)
            {
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_EN, llBle);
            }
#endif /* cPWR_BLE_LL_Enable */              
#if cPWR_GENFSK_LL_Enable             
            if(llGfsk)
            {
                RSIM->DSM_CONTROL = (RSIM->DSM_CONTROL & (~RSIM_DSM_CONTROL_GEN_SYSCLK_REQ_INT_MASK)) | RSIM_DSM_CONTROL_GEN_SYSCLK_REQUEST_EN_MASK ;
            }
#endif /* cPWR_GENFSK_LL_Enable */              
            /* wait for READY bit to be set again */
            count_down = cPWR_RfReadyBitTimeout;
            
            while( (RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_READY) == 0U) && (count_down!=0U) )
            {
                count_down--;
            }
            
            /* timeout occurs again,  turn the XTAl Off again and reset the device */
            if ( count_down == 0U )
            {
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0U);
#if cPWR_BLE_LL_Enable                
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_EN, 0U);
#endif /* cPWR_BLE_LL_Enable */                 
#if cPWR_GENFSK_LL_Enable                   
                RSIM->DSM_CONTROL &= ~(RSIM_DSM_CONTROL_GEN_SYSCLK_REQUEST_EN_MASK | RSIM_DSM_CONTROL_GEN_SYSCLK_REQ_INT_MASK);
#endif /* cPWR_GENFSK_LL_Enable */                  
                /* wait some time for Oscillator to switch off */
                PWRLib_DelayLoop(mPWR_RFOscRecoveryWaitSwitchOffInLoopCounts_c);
                NVIC_SystemReset();
            }
        }
    }
}

#if (cPWR_BLE_LL_Enable)
/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_ConfigDSM
 * Description: 
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_BLL_ConfigDSM(uint8_t lpMode)
{
    BLE_LL_REG(WAKEUP_CONFIG) = (((cPWR_BLE_LL_OffsetToWakeupInstant << BLE_LL_WAKEUP_CONFIG_DSM_OFFSET_SHIFT) & BLE_LL_WAKEUP_CONFIG_DSM_OFFSET_MASK) |
                                 ((((cPWR_BLE_LL_OscStartupDelay & BLE_LL_OSC_STARTUP_DELAY_CLK_MASK) >> BLE_LL_OSC_STARTUP_DELAY_CLK_SHIFT)<<BLE_LL_WAKEUP_CONFIG_OSC_DELAY_CLK_SHIFT) & BLE_LL_WAKEUP_CONFIG_OSC_DELAY_CLK_MASK) |
                                  BLE_LL_WAKEUP_CONFIG_CON_RAM_DSM_RET);
    BLE_LL_REG(WAKEUP_CONFIG2) = ((((cPWR_BLE_LL_OscStartupDelay & BLE_LL_OSC_STARTUP_DELAY_SLOT_MASK) >> BLE_LL_OSC_STARTUP_DELAY_SLOT_SHIFT)<<BLE_LL_WAKEUP_CONFIG2_OSC_DELAY_SLOT_SHIFT) & BLE_LL_WAKEUP_CONFIG2_OSC_DELAY_SLOT_MASK);

    if(lpMode)
    {
        BLE_LL_REG(CLOCK_CONFIG) = maBLE_LL_CLOCK_CONFIG_LP[lpMode - 1];
    }
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_ClearRSIMInt
 * Description: 
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
bool_t PWRLib_ClearRSIMInt(void)
{
    if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_INT))
    {
        RSIM->CONTROL = RSIM->CONTROL ;
        return TRUE;
    }
    if( (RSIM->CONTROL & RSIM_CONTROL_RSIM_DSM_EXIT_MASK) && (BLE_LL_REG(EVENT_STATUS) & BLE_LL_EVENT_STATUS_DSM_INT_MASK))
    {
        RSIM->CONTROL &= ~RSIM_CONTROL_RSIM_DSM_EXIT_MASK;
        BLE_LL_REG(EVENT_CLEAR) = BLE_LL_EVENT_CLEAR_DSM_INT_MASK;
    }
    return FALSE;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_GetOffsetSlotsBeforeDsmExit
 * Description: Returns dsm_offset_to_wakeup_instant + osc_startup_delay
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
uint16_t PWRLib_BLL_GetOffsetSlotsBeforeDsmExit(void)
{
    uint16_t wakeupConfig, offsetSlots;
    
    wakeupConfig =  BLE_LL_REG(WAKEUP_CONFIG);
    offsetSlots = (wakeupConfig & BLE_LL_WAKEUP_CONFIG_DSM_OFFSET_MASK) >> BLE_LL_WAKEUP_CONFIG_DSM_OFFSET_SHIFT;
    offsetSlots += (BLE_LL_REG(WAKEUP_CONFIG2) & BLE_LL_WAKEUP_CONFIG2_OSC_DELAY_SLOT_MASK) >> BLE_LL_WAKEUP_CONFIG2_OSC_DELAY_SLOT_SHIFT;

    if(wakeupConfig & BLE_LL_WAKEUP_CONFIG_OSC_DELAY_CLK_MASK)
    {
        offsetSlots++;
    }
    
    return offsetSlots;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_EnterDSM
 * Description: 
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_BLL_EnterDSM(void)
{
    //while((BLE_LL_REG(CLOCK_CONFIG) & BLE_LL_CLOCK_CONFIG_LLH_IDLE_MASK ) == 0);
    BLE_LL_REG(EVENT_CLEAR) = BLE_LL_EVENT_CLEAR_DSM_INT_MASK;
    BLE_LL_REG(COMMAND_REGISTER) = ENTER_DSM;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_GetInstantTimer
 * Description: 
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
uint16_t PWRLib_BLL_GetInstantTimer(void)
{
    return BLE_LL_REG(TIM_COUNTER_L);
}

