Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/LowPower/Source/MKW36Z/PWRLib.c
/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_GetWakeUpFlags
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
uint32_t PWRLib_LLWU_GetWakeUpFlags(void)
{
    uint32_t Flags;
    
    Flags = LLWU->F1;
    Flags |= (uint32_t)((uint32_t)LLWU->F2 << 8U);
    Flags |= (uint32_t)((uint32_t)LLWU->F3 << 16U);
    
    if ((LLWU->FILT1 & 0x80U) != 0x00U ) 
    {
        Flags |= LLWU_FILTER1;
    }
    
    if ((LLWU->FILT2 & 0x80U) != 0x00U ) 
    {
        Flags |= LLWU_FILTER2;
    }
    
    return Flags;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_UpdateWakeupReason
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LLWU_UpdateWakeupReason(void)
{
    uint32_t  llwuFlags;
    
    llwuFlags =  PWRLib_LLWU_GetWakeUpFlags();
    
#if BOARD_LLWU_PIN_ENABLE_BITMAP
    if(llwuFlags & BOARD_LLWU_PIN_ENABLE_BITMAP)
    {
        PWRLib_MCU_WakeupReason.Bits.FromKeyBoard = 1; 
    }
#endif /* BOARD_LLWU_PIN_ENABLE_BITMAP */
    
    if(llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_LPTMR_c)
    {
        PWRLib_MCU_WakeupReason.Bits.FromLPTMR = 1;
        PWRLib_MCU_WakeupReason.Bits.DeepSleepTimeout = 1;
    }
    
    if(llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_Radio_c)
    {
        PWRLib_MCU_WakeupReason.Bits.FromBLE_LLTimer = 1;
        
        if(RSIM->DSM_CONTROL & (RSIM_DSM_CONTROL_GEN_SYSCLK_REQ_INT_MASK))
        {
            PWRLib_MCU_WakeupReason.Bits.FromRadio = 1;
        }
        
        PWRLib_MCU_WakeupReason.Bits.DeepSleepTimeout = 1;
    }
    
    if(llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_DCDC_c)
    {
        PWRLib_MCU_WakeupReason.Bits.FromPSwitch_UART = 1;
    }
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_DisableAllWakeupSources
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LLWU_DisableAllWakeupSources(void)
{
    LLWU->PE1 = 0;
    LLWU->PE2 = 0;
    LLWU->PE3 = 0;
    LLWU->PE4 = 0;
    LLWU->ME = 0;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_GetMaxFreqTicks
 * Description: -
 * Parameters: - [in] ticks, lptmrFreq
 * Return: No of ticks of max LPTMR freq(32768Hz) equivalent with ticks of lptmrFreq
 *---------------------------------------------------------------------------*/
uint32_t PWRLib_LPTMR_GetMaxFreqTicks(uint32_t ticks, uint32_t lptmrFreq)
{
    uint32_t maxFreq = mLptmrMaxFreq_c;
    if(lptmrFreq)
    {
        while(lptmrFreq < maxFreq)
        {
            ticks <<= 1U;
            lptmrFreq <<= 1U;
        }
    }
    return  ticks;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_GetMaxDurationForTheSameFreq
 * Description: -
 * Parameters: - [in] timeInMs
 * Return: - Returns the maximum duration the LPTMR can measure with the 
 *           same frequency needed to measure input parameter
 *---------------------------------------------------------------------------*/
uint32_t PWRLib_LPTMR_GetMaxDurationForTheSameFreq(uint32_t timeInMs)
{
    uint32_t maxDurMs;  
    if(timeInMs > mLptmrTimoutMaxMs_c)
    {
        maxDurMs = mLptmrTimoutMaxMs_c;
    }
    else
    {
        maxDurMs = 2000U;
        while(timeInMs >= maxDurMs)
        {
            maxDurMs <<= 1U;
        }
        maxDurMs -= 1U;
    }
    return maxDurMs;  
}
/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_GetTimeSettings
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_GetTimeSettings(uint32_t timeInMs, uint8_t* pClkMode,uint32_t* pTicks, uint32_t* pFreq)
{
    uint64_t ticks64;
    uint32_t ticks;
    uint8_t prescaler = 0;
    uint8_t bypass = LPTMR_PSR_PBYP_MASK;
    uint32_t freq = mLptmrMaxFreq_c;
    
    if(timeInMs > mLptmrTimoutMaxMs_c)
    {
        timeInMs = mLptmrTimoutMaxMs_c;
    }
    
    ticks64 = timeInMs;
    ticks64 *= mLptmrMaxFreq_c;
    ticks64 /= 1000;
    ticks = ticks64;
    
    while(ticks & 0xFFFF0000)
    {
        if(bypass)
        {
            bypass = 0;
        }
        else
        {
            prescaler++;
        }
        
        ticks >>= 1;
        freq >>= 1;
    }
    
    *pClkMode = (prescaler<<LPTMR_PSR_PRESCALE_SHIFT)| bypass | cLPTMR_Source_Ext_ERCLK32K;
    *pTicks = ticks;
    *pFreq = freq;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_GetTimeSettingsFromLptmrMaxFreqTicks
 * Description: -
 * Parameters: - [in] lptmrTicks LPTMR max frequency ticks (32768 Hz)
 * Parameters: - [out] pClkMode, pTicks, pFreq
 * Return: LPTMR setings needed to measure the input 
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_GetTimeSettingsFromLptmrMaxFreqTicks(uint64_t lptmrTicks, uint8_t* pClkMode,uint32_t* pTicks, uint32_t* pFreq)
{
    uint32_t ticks;
    uint8_t prescaler = 0;
    uint8_t bypass = LPTMR_PSR_PBYP_MASK;
    uint32_t freq = mLptmrMaxFreq_c;
   
    if(lptmrTicks > mLptmrTimoutMaxFreqTicks_c)
    {
        lptmrTicks = mLptmrTimoutMaxFreqTicks_c;
    }
    ticks = lptmrTicks;
    while(ticks & 0xFFFF0000)
    {
        if(bypass)
        {
            bypass = 0;
        }
        else
        {
            prescaler++;
        }
        
        ticks >>= 1;
        freq >>= 1;
    }
    
    *pClkMode = (prescaler<<LPTMR_PSR_PRESCALE_SHIFT)| bypass | cLPTMR_Source_Ext_ERCLK32K;
    *pTicks = ticks;
    *pFreq = freq;
}
/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockStart
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_ClockStart(uint8_t ClkMode, uint32_t Ticks)
{
    OSA_InterruptDisable();
    
    LPTMR0->CSR &= ~LPTMR_CSR_TEN_MASK;
    
    /* Set compare value */
    if(Ticks)
    {
        Ticks--;
    }
    
    LPTMR0->CMR = Ticks;
    /* Use specified tick count */
    mPWRLib_RTIElapsedTicks = 0;
    /* Configure prescaler, bypass prescaler and clck source */
    LPTMR0->PSR = ClkMode;
    LPTMR0->CSR |= LPTMR_CSR_TFC_MASK;
    /* Start counting */
    LPTMR0->CSR |= LPTMR_CSR_TEN_MASK;
    
    OSA_InterruptEnable();
}

