Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/LowPower/Source/MKW36Z/PWRLib.c
/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockCheckLight
 * Description: To be used when it is certain that the interrupts are disabled,
 *              the LPTMR is ON and no roll over has occurred
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
uint32_t PWRLib_LPTMR_ClockCheckLight(void)
{
    
    LPTMR0->CNR = 0U;  /* CNR must be written first in order to be read */
    return LPTMR0->CNR;
}
/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockCheck
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
uint32_t PWRLib_LPTMR_ClockCheck(void)
{
    OSA_InterruptDisable();
    
    /* LPTMR is still running */
    if(LPTMR0->CSR & LPTMR_CSR_TEN_MASK)
    {
        LPTMR0->CNR = 0;  /* CNR must be written first in order to be read */
        mPWRLib_RTIElapsedTicks = LPTMR0->CNR;
        
        /* timer compare flag is set */
        if(LPTMR0->CSR & LPTMR_CSR_TCF_MASK)
        {
            uint32_t compareReg;
            
            compareReg = LPTMR0->CMR;
            
            if(mPWRLib_RTIElapsedTicks < compareReg)
            {
                mPWRLib_RTIElapsedTicks += 0x10000;
            }
        }
    }
    
    OSA_InterruptEnable();
    
    return mPWRLib_RTIElapsedTicks;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockStop
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_ClockStop(void)
{
    OSA_InterruptDisable();
    
    /* LPTMR is still running */
    if(LPTMR0->CSR & LPTMR_CSR_TEN_MASK)
    {
        LPTMR0->CNR = 0;  /* CNR must be written first in order to be read */
        mPWRLib_RTIElapsedTicks = LPTMR0->CNR;
        
        /* timer compare flag is set */
        if(LPTMR0->CSR & LPTMR_CSR_TCF_MASK)
        {
            uint32_t compareReg;
            
            compareReg = LPTMR0->CMR;
            
            if(mPWRLib_RTIElapsedTicks < compareReg)
            {
                mPWRLib_RTIElapsedTicks += 0x10000;
            }
        }
    }
    
    /* Stop LPTMR */
    LPTMR0->CSR &= ~LPTMR_CSR_TEN_MASK;
    
    OSA_InterruptEnable();
}
#if mPWR_WaitFor32kOscStart_c
/*---------------------------------------------------------------------------
 * Name: PWRLib_Get32KHzOscStatus
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
osc32KStatus_t PWRLib_Get32KHzOscStatus(void)
{
    return mOsc32KStatus;
}
/*---------------------------------------------------------------------------
 * Name: PWRLib_Check32KHzOscStatus
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
osc32KStatus_t PWRLib_Check32KHzOscStatus(void)
{
    uint8_t clkMode;
    uint32_t lptmrTicks;
    uint32_t lptmrFreq;
    uint32_t sleepTimeMs = 10 ;
    delayFctCall_t delayFctCall;
    if(mOsc32KStatus == gOsc32K_NotStarted_c)
    {
        delayFctCall.funcAddress = (uint32_t)(mDelayFct) + 1;
        PWRLib_LPTMR_GetTimeSettings(sleepTimeMs ,&clkMode ,&lptmrTicks, &lptmrFreq);
        PWRLib_LPTMR_ClockStart(clkMode,lptmrTicks);
        delayFctCall.functionCall(mTwo32KTicksDuration_c);
        PWRLib_LPTMR_ClockStop();
        if(PWRLib_LPTMR_ClockCheck())
        { 
#if cPWR_32kOscStabilizationDelayInMs 
            mOsc32KStatus = gOsc32K_Unstable_c;
            PWRLib_LPTMR_GetTimeSettings(cPWR_32kOscStabilizationDelayInMs ,&clkMode ,&lptmrTicks, &lptmrFreq);
            PWRLib_LPTMR_ClockStart(clkMode,lptmrTicks);
#else
            mOsc32KStatus = gOsc32K_Ready_c;
#endif /*cPWR_32kOscStabilizationDelayInMs*/         
        } 
    }
    return mOsc32KStatus;
}
#endif /* mPWR_WaitFor32kOscStart_c */

/*---------------------------------------------------------------------------
 * Name: PWRLib_DelayLoop
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_DelayLoop(uint32_t loopCounts)
{
      delayFctCall_t delayFctCall;
      delayFctCall.funcAddress = (uint32_t)(mDelayFct) + 1U;
      delayFctCall.functionCall(loopCounts);
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_DelayLoopRemainingTicks
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_DelayLoopRemainingTicks(uint32_t ticks32K, uint32_t lptmrTicks, uint32_t lptmrFreq)
{
    delayFctCall_t delayFctCall;
    uint32_t ticks32KElapsed = 0U;
    /*only lptmrTicks - 1 we can know for sure that have elapsed */
    if(lptmrTicks > 1U)
    {
        ticks32KElapsed = lptmrTicks - 1U;
        uint32_t i = 1U<<15U;
        while(i && (ticks32K > ticks32KElapsed))
        {
            if((i & lptmrFreq) != 0U)
            {
                break;
            }
            i >>= 1U;
            ticks32KElapsed <<= 1U;
        }
    }
    if(ticks32K > ticks32KElapsed)
    {
        ticks32K -= ticks32KElapsed;
        delayFctCall.funcAddress = (uint32_t)(mDelayFct) + 1U;
        while(ticks32K--)
        {
            delayFctCall.functionCall(mPWR_32kTickInLoopTicks_c);
        }
    }
}
/*---------------------------------------------------------------------------
 * Name: PWRLib_StopUpdateWakeupReason
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_StopUpdateWakeupReason(void)
{
    uint32_t iser;
    uint32_t ispr;
    
    iser = NVIC->ISER[0];
    ispr = NVIC->ISPR[0];

    if(( iser & ispr) & (1 << mUartIrq_d))
    {
        PWRLib_MCU_WakeupReason.Bits.FromPSwitch_UART = 1;
    }
    
    if(( iser & ispr) & (1 << LVD_LVW_DCDC_IRQn))
    {
        PWRLib_MCU_WakeupReason.Bits.FromPSwitch_UART = 1;
    }
    
